{
  "T0": {
    "topic_id": "T0",
    "bertopic_id": 0,
    "title": "Stock Market Movements",
    "summary": "OVERVIEW:\nRecent market shifts highlight a decline in specific stocks while others see gains amid changing investor strategies. Themes include profit misses, shifts in investor focus, and varying stock performances across sectors.\n\nKEY EXAMPLES:\n- Wingstop's stock dropped 12% following a disappointing profit report.\n- Robinhood's stock also fell 8% due to a significant decrease in November trading volumes.\n- In contrast, Novartis raised its sales and profit forecast, positively impacting its stock.\n- The S&P 500 saw some gains despite concerns over Oracle's earnings and record high positioning levels.",
    "article_count": 46,
    "topicality": 46.0,
    "theme_weight": 0.9695652173913044,
    "theme": "Inflation"
  },
  "T1": {
    "topic_id": "T1",
    "bertopic_id": 1,
    "title": "Disney's Investment in AI",
    "summary": "OVERVIEW:\nDisney is partnering with OpenAI as part of a significant investment and licensing deal that aims to engage younger audiences through innovative technology, despite mixed investor reactions regarding the viability of AI investments.\n\nKEY EXAMPLES:\n- Disney CEO Bob Iger announced a licensing deal with OpenAI, allowing the use of Disney characters in OpenAI's Sora video tool.\n- Investors express concern over the technology sector's investment in AI, particularly regarding the potential return on investment in companies like OpenAI.\n- Disney plans to invest $1 billion in OpenAI, reflecting its commitment to leveraging AI technology for audience engagement.",
    "article_count": 39,
    "topicality": 39.0,
    "theme_weight": 1.0,
    "theme": "Others"
  },
  "T2": {
    "topic_id": "T2",
    "bertopic_id": 2,
    "title": "Mexican Tariffs on Imports",
    "summary": "OVERVIEW:\nMexico's recent decision to impose tariffs of up to 50% on over 1,400 products from Asian countries, particularly targeting Chinese imports, marks a significant shift in trade policy as the country prepares to review its trade agreement with the U.S. and Canada.\n\nKEY EXAMPLES:\n- President Claudia Sheinbaum defended the tariffs as a strategy to bolster domestic industries.\n- The Mexican Senate approved the tariffs which impact categories such as auto parts, textiles, and plastics, starting in January 2026.\n- Analysts speculate that this move aligns with U.S. pressure on countries to mitigate trade ties with China.",
    "article_count": 31,
    "topicality": 31.0,
    "theme_weight": 0.9903225806451613,
    "theme": "Inflation"
  },
  "T3": {
    "topic_id": "T3",
    "bertopic_id": 3,
    "title": "Banking System Dynamics",
    "summary": "OVERVIEW:\nThe recent articles explore the evolving landscape of the U.S. banking system, focusing on risk management, solvency metrics, and the integration of nonbank financial institutions, highlighting the implications for financial stability.\n\nKEY EXAMPLES:\n- The introduction of the Federal Reserve's Bank Term Funding Program significantly reduced investor risk perceptions during the 2023 bank run.\n- A new solvency metric, Economic Capital, proves to be more effective in identifying failing banks than traditional measures.\n- Recent developments in tokenized investment funds raise concerns about their potential interconnectivity with the traditional financial system due to new ETF approvals and regulations.",
    "article_count": 31,
    "topicality": 31.0,
    "theme_weight": 0.9999999999999998,
    "theme": "Bank lending and credit risk"
  },
  "T4": {
    "topic_id": "T4",
    "bertopic_id": 4,
    "title": "Fraud and Cybercrime Risks",
    "summary": "OVERVIEW:\nRecent discussions highlight the increasing risks of fraud and cybercrime, exacerbated by the pandemic and emerging technologies. Experts stress the importance of awareness and preparedness to combat these threats.\n\nKEY EXAMPLES:\n- A report indicates that pandemic-related spending has raised the vulnerability to fraud and errors.\n- Ransomware attacks have become more sophisticated, targeting a wide range of organizations, including government entities.\n- Phishing groups are innovating their tactics by offering kits for creating fake e-commerce websites to steal payment information.",
    "article_count": 30,
    "topicality": 30.0,
    "theme_weight": 0.9933333333333334,
    "theme": "Cyber attacks"
  },
  "T5": {
    "topic_id": "T5",
    "bertopic_id": 5,
    "title": "Cryptocurrency Market Fluctuations",
    "summary": "OVERVIEW:\nRecent developments, including a Fed interest rate cut and trade policy shifts, have led to significant volatility in the cryptocurrency market, particularly impacting Bitcoin and altcoins.\n\nKEY EXAMPLES:\n- Bitcoin briefly fell below $90K before bouncing back to $93K after the Fed's rate cut.\n- TON experienced a 3.3% decline to $1.59 as the broader crypto market weakened.\n- Economic uncertainty related to U.S. trade policies has contributed to souring investor risk appetite, causing Bitcoin prices to fluctuate.",
    "article_count": 28,
    "topicality": 28.0,
    "theme_weight": 0.9821428571428571,
    "theme": "Inflation"
  },
  "T6": {
    "topic_id": "T6",
    "bertopic_id": 6,
    "title": "Cryptocurrency Regulatory Developments",
    "summary": "OVERVIEW:\nThe cryptocurrency landscape is experiencing significant regulatory shifts as various global jurisdictions adapt their legal frameworks to better integrate cryptoassets with traditional finance and address security concerns.\n\nKEY EXAMPLES:\n- South Korea's major crypto exchange detected suspicious withdrawal activities, demonstrating increased security challenges in the crypto market.\n- Brazil is working on a comprehensive regulatory framework for cryptoassets, aiming for implementation by 2026.\n- Belarus has blocked access to several major crypto exchanges, aligning with Russia's regulatory adjustments in the crypto space.",
    "article_count": 28,
    "topicality": 28.0,
    "theme_weight": 0.7535714285714284,
    "theme": "Digital assets"
  },
  "T7": {
    "topic_id": "T7",
    "bertopic_id": 7,
    "title": "House Committee Reports",
    "summary": "OVERVIEW:\nMultiple articles report on actions taken by the House Committee on Oversight and Government Reform, all dated December 2, 2025. The consistent theme is the committee's proceedings and decisions.\n\nKEY EXAMPLES:\n- All articles reference decisions made by the House Committee on Oversight and Government Reform on the same date.\n- Each article indicates the committee's role in reporting legislative actions.",
    "article_count": 28,
    "topicality": 28.0,
    "theme_weight": 1.0035714285714286,
    "theme": "Cyber attacks"
  },
  "T8": {
    "topic_id": "T8",
    "bertopic_id": 8,
    "title": "**Rising Cybersecurity Vulnerabilities**",
    "summary": "OVERVIEW:\nRecent reports highlight a surge in cyberattacks exploiting newly disclosed vulnerabilities, particularly against the CVE-2025-55182 and critical flaws in major software including Microsoft and Google products.\n\nKEY EXAMPLES:\n- Attacks exploiting CVE-2025-55182 have intensified following its public disclosure last week.\n- Google fixed a critical vulnerability that allowed attackers to manipulate documents for corporate data theft.\n- Microsoft issued security updates addressing over 60 vulnerabilities, including a zero-day bug under active exploitation. \n- The React JavaScript library has also seen a maximum-severity vulnerability exploited, emphasizing the urgency of timely patches.",
    "article_count": 27,
    "topicality": 27.0,
    "theme_weight": 1.0,
    "theme": "Cyber attacks"
  },
  "T9": {
    "topic_id": "T9",
    "bertopic_id": 9,
    "title": "Federal Reserve Board Actions",
    "summary": "OVERVIEW:\nThe Federal Reserve Board is actively enhancing its regulatory framework and services related to bank supervision, payment services, and enforcement actions against former employees of various banks. Additionally, it seeks public input regarding changes to check services.\n\nKEY EXAMPLES:\n- The Federal Reserve released information about improvements to bank supervision practices to ensure stronger oversight.\n- Public input is being sought on proposed adjustments to check services and related user preferences.\n- Enforcement actions were issued against former employees from multiple banks, including First Financial Bank and Synovus Bank.\n- The Fed announced new pricing for its payment services, set to take effect on January 1, 2026.",
    "article_count": 27,
    "topicality": 27.0,
    "theme_weight": 1.0814814814814815,
    "theme": "Bank lending and credit risk"
  },
  "T10": {
    "topic_id": "T10",
    "bertopic_id": 10,
    "title": "Cryptocurrency Market Trends",
    "summary": "OVERVIEW:\nRecent developments in the cryptocurrency market highlight a divergence between Bitcoin and Ethereum, with Ethereum experiencing significant gains and lower transaction fees, while Bitcoin struggles to maintain upward momentum.\n\nKEY EXAMPLES:\n- Ethereum has seen a rally with prices holding above $3,300 following a Federal Reserve rate cut, indicating strong market confidence.\n- Bitcoin's price has faced rejection at $94,000 despite bullish sentiment surrounding US monetary policy.\n- XRP has seen substantial ETF inflows of nearly $1 billion, but its price signals caution as it reacts negatively to market trends.",
    "article_count": 26,
    "topicality": 26.0,
    "theme_weight": 0.8884615384615384,
    "theme": "Digital assets"
  },
  "T11": {
    "topic_id": "T11",
    "bertopic_id": 11,
    "title": "Trade Deficit and Prices",
    "summary": "OVERVIEW:\nRecent reports indicate a significant drop in the monthly trade deficit in the U.S., attributed to new global tariffs imposed by the president. Concurrently, there are ongoing discussions about price trends, particularly concerning consumer price indices and specific commodity prices such as electricity.\n\nKEY EXAMPLES:\n- The trade deficit fell to its lowest level in five years due to the president's sweeping global tariffs.\n- A surge in electricity prices has been observed, with a 7% increase reported between January and August 2025.",
    "article_count": 26,
    "topicality": 26.0,
    "theme_weight": 1.0,
    "theme": "Inflation"
  },
  "T12": {
    "topic_id": "T12",
    "bertopic_id": 12,
    "title": "Federal Reserve Interest Rate Cuts",
    "summary": "OVERVIEW:\nThe Federal Reserve has implemented a series of interest rate cuts in response to economic conditions, with the latest reduction aimed at stabilizing a weakening labor market. However, the future trajectory of these cuts is uncertain as internal disagreements persist within the central bank.\n\nKEY EXAMPLES:\n- The Fed lowered interest rates for the third time this year, reflecting a cautious approach amidst a softening economy.\n- President Trump is advocating for more significant cuts, but Fed officials indicate they may resist further reductions without clear economic justification.\n- Recent rate cuts have led to discussions about their potential long-term consequences, with some experts suggesting future decisions may appear reckless.",
    "article_count": 23,
    "topicality": 23.0,
    "theme_weight": 1.0521739130434782,
    "theme": "Recessionary pressures"
  },
  "T13": {
    "topic_id": "T13",
    "bertopic_id": 13,
    "title": "AI Developments and Concerns",
    "summary": "OVERVIEW:\nRecent news highlights both the rapid advancements in artificial intelligence and the associated challenges, particularly regarding security, trust, and practical applications in various industries.\n\nKEY EXAMPLES:\n- Microsoft announced a new era of AI agents, but enterprise adoption remains low due to security concerns.\n- The company aims to empower non-technical users with AI tools, raising potential security issues as a result.\n- Hollywood faces dilemmas related to the implications of generative AI, navigating both its advantages and potential harms.",
    "article_count": 22,
    "topicality": 22.0,
    "theme_weight": 1.0,
    "theme": "AI"
  },
  "T14": {
    "topic_id": "T14",
    "bertopic_id": 14,
    "title": "Legal Proceedings and Political Developments",
    "summary": "OVERVIEW:\nThis cluster of news articles highlights ongoing legal cases, including significant court decisions and political maneuvers across various jurisdictions, focusing on the implications of these events on individuals and governance.\n\nKEY EXAMPLES:\n- Do Kwon's upcoming sentencing hearing in a U.S. federal court, where he faces up to 12 years in prison, is accompanied by a pending judgment in South Korea and serious allegations regarding fraud.\n- A U.S. judge ruled that Kilmar Abrego Garcia, previously wrongfully deported, must be released, reflecting ongoing scrutiny of immigration policies from the Trump administration.\n- Thailand’s Prime Minister Anutin Charnvirakul has announced plans to dissolve parliament, prompting an early election after a key political party withdrew support for his government.",
    "article_count": 9,
    "topicality": 9.0,
    "theme_weight": 1.0444444444444445,
    "theme": "Others"
  }
}