{
  "T0": {
    "topic_id": "T0",
    "bertopic_id": 0,
    "title": "Cybercrime Trends and Tactics",
    "summary": "OVERVIEW:\nRecent articles detail the evolution of cybercrime tactics, emphasizing increased aggression in extortion, the proliferation of botnets, and new trends in phishing and malware delivery. The methods utilized by both state-sponsored and non-state actors are becoming more sophisticated and targeted.\n\nKEY EXAMPLES:\n- A cybercrime group has intensified its extortion tactics following previous attacks on Salesforce instances.\n- The Kimwolf botnet has rapidly compromised over two million devices by targeting Android TV streaming boxes.\n- State-sponsored actors are leveraging update infrastructures to distribute backdoored applications, compromising user security.",
    "article_count": 39,
    "topicality": 39.0,
    "theme_weight": 1.005128205128205,
    "theme": "Cyber attacks"
  },
  "T1": {
    "topic_id": "T1",
    "bertopic_id": 1,
    "title": "AI Disruption in Software Industry",
    "summary": "OVERVIEW: \nRecent advancements in artificial intelligence have caused significant fluctuations in the software market, prompting both excitement and concern among investors and industry professionals. The uncertainty surrounding AI's impact on sectors like finance and software has led to increased scrutiny and strategic adjustments.\n\nKEY EXAMPLES:\n- Wall Street experienced a sell-off due to fears of AI disruptions in the economy.\n- Michelle Miller highlights the need for companies to adapt to changes driven by AI pressures on software stocks.\n- Global software and data firms are facing declines amid escalating concerns over AI and major capital expenditure plans. \n- AI agents are transforming HR processes, while also challenging traditional roles in bug bounty hunting and penetration testing.",
    "article_count": 38,
    "topicality": 38.0,
    "theme_weight": 1.0,
    "theme": "AI"
  },
  "T2": {
    "topic_id": "T2",
    "bertopic_id": 2,
    "title": "Bitcoin Market Struggles",
    "summary": "OVERVIEW:\nRecent articles highlight a significant downturn in Bitcoin's market performance, with prices falling below critical thresholds amid concerns over ETF outflows and overall demand.\n\nKEY EXAMPLES:\n- Bitcoin dropped below $70,000 for the first time in over a year, with warnings of further declines.\n- ETF outflows reached $690 million, indicating a potential demand crisis as Bitcoin's price approached a dangerous $56,100 floor.\n- The Crypto Fear & Greed Index recently hit its lowest level since 2022, reflecting a significant drop in market confidence.",
    "article_count": 38,
    "topicality": 38.0,
    "theme_weight": 0.8026315789473684,
    "theme": "Digital assets"
  },
  "T3": {
    "topic_id": "T3",
    "bertopic_id": 3,
    "title": "Bitcoin Price Decline and Market Impact",
    "summary": "OVERVIEW:\nRecent significant declines in Bitcoin's price have triggered concerns about the stability of the cryptocurrency market, with predictions of a possible \"crypto winter\" and the impact of external economic factors, including political threats.\n\nKEY EXAMPLES:\n- Bitcoin's price recently fell to around $60,000 from a peak of $124,000, resulting in a loss of over $2 trillion in the digital asset market.\n- Speculation surrounding Bitcoin hitting $200,000 by 2025 now appears unrealistic due to the current market conditions.\n- The drop in Bitcoin's value has intensified stress on companies heavily invested in the cryptocurrency, as they struggle to manage their treasury strategies during this downturn.",
    "article_count": 36,
    "topicality": 36.0,
    "theme_weight": 0.85,
    "theme": "Digital assets"
  },
  "T4": {
    "topic_id": "T4",
    "bertopic_id": 4,
    "title": "Economic Tensions in Europe",
    "summary": "OVERVIEW:\nRecent news highlights various economic pressures affecting Europe, particularly in relation to currency fluctuations, trade regulations, and geopolitical tensions.\n\nKEY EXAMPLES:\n- The Asian foreign exchange market experiences declines as the dollar strengthens ahead of crucial European Central Bank and Bank of England meetings.\n- The EU plans to enhance its carbon pricing policy by implementing the Carbon Border Adjustment Mechanism (CBAM) to address high-emissions imports.\n- New European initiatives aim to target Russia’s shadow fleet, potentially inflicting serious economic damage on Russia amidst its vulnerabilities.",
    "article_count": 32,
    "topicality": 32.0,
    "theme_weight": 0.9875,
    "theme": "Inflation"
  },
  "T5": {
    "topic_id": "T5",
    "bertopic_id": 5,
    "title": "Economic Trends and Data Collection",
    "summary": "OVERVIEW:\nRecent articles highlight the importance of economic indicators and data collection in understanding labor market dynamics, particularly focusing on small businesses, poverty levels, and employment statistics amidst disruptions like government shutdowns.\n\nKEY EXAMPLES:\n- The New York Fed introduced Economic Heterogeneity Indicators to analyze small business performance, showing their critical role in job creation and economic support.\n- The government shutdown affected the timely release of employment data, marking the longest lapse in congressional appropriations on record, highlighting the vulnerabilities in economic data collection.\n- An increase in labor force participation among workers with disabilities post-pandemic was noted, although their earnings remained significantly lower than those without disabilities.",
    "article_count": 29,
    "topicality": 29.0,
    "theme_weight": 1.0172413793103448,
    "theme": "Consumer debt"
  },
  "T6": {
    "topic_id": "T6",
    "bertopic_id": 6,
    "title": "Stock Market Fluctuations",
    "summary": "OVERVIEW:\nRecent developments in the stock market indicate volatility, with significant changes in stock valuations and earnings reports. Various companies are experiencing both gains and setbacks, contributing to a complex market landscape.\n\nKEY EXAMPLES:\n- Wingstop's stock dropped 12% after reported profits fell short of estimates.\n- Amazon faced a decline due to a high capital expenditures forecast. \n- Earnings reports from major Silicon Valley companies show strong results, yet stocks still tumbled. \n- Plus500 reported an 11% revenue increase and stated it would meet expectations.",
    "article_count": 29,
    "topicality": 29.0,
    "theme_weight": 0.9551724137931032,
    "theme": "Digital assets"
  },
  "T7": {
    "topic_id": "T7",
    "bertopic_id": 7,
    "title": "Corporate Resignations and Controversies",
    "summary": "OVERVIEW:\nA series of high-profile resignations and strikes highlight growing tensions in corporate environments, driven by ethical concerns and policy changes. Employees and executives alike are responding to deteriorating workplace cultures and significant external impacts.\n\nKEY EXAMPLES:\n- Workers are staging strikes and resigning over their bosses' handling of immigration policies.\n- Brad Karp resigned from Paul Weiss amid troubling revelations connected to Jeffrey Epstein.\n- Tesla's Musk notes the allure of tech giant affiliations in hiring, reflecting on industry pressures.",
    "article_count": 29,
    "topicality": 29.0,
    "theme_weight": 1.0344827586206897,
    "theme": "Others"
  },
  "T8": {
    "topic_id": "T8",
    "bertopic_id": 8,
    "title": "Global Economic Trends and Investments",
    "summary": "OVERVIEW:\nRecent developments highlight a shift in investment focus globally, particularly between China and Germany, as companies and executives reassess their strategies amidst changing political and economic landscapes.\n\nKEY EXAMPLES:\n- Japan's top dealer is enhancing its global presence by shifting away from risk warehousing to attract real money clients.\n- German companies are increasingly looking towards investments in China due to diminishing confidence in the U.S., despite facing challenges in the Chinese market.\n- Fosun Pharma's licensing deal with Japan's Eisai exemplifies the trend of Chinese drug makers engaging in long-term collaborations with global partners.",
    "article_count": 27,
    "topicality": 27.0,
    "theme_weight": 0.9777777777777777,
    "theme": "AI"
  },
  "T9": {
    "topic_id": "T9",
    "bertopic_id": 9,
    "title": "Recent Committee Reports",
    "summary": "OVERVIEW:\nVarious House committees have recently reported on a series of legislative matters, highlighting ongoing discussions and proposals within the U.S. Congress.\n\nKEY EXAMPLES:\n- The House Committee on Transportation and Infrastructure reported on multiple orders on December 18, 2025.\n- The House Committee on the Judiciary also reported on December 18, 2025.\n- The House Committee on Ways and Means submitted reports on January 14, 2026.\n- The House Committee on Foreign Affairs issued a report on December 3, 2025.",
    "article_count": 25,
    "topicality": 25.0,
    "theme_weight": 1.032,
    "theme": "Others"
  },
  "T10": {
    "topic_id": "T10",
    "bertopic_id": 10,
    "title": "Federal Reserve Economic Updates",
    "summary": "OVERVIEW:\nRecent articles provide insights into the Federal Reserve's economic forecasts and monetary policy strategies amidst rising inflation and labor market conditions. Expectations for growth in 2025 are tempered by higher inflation projections due to tariffs and external cost pressures.\n\nKEY EXAMPLES:\n- The Federal Reserve's updated forecasts indicate stronger growth in 2025, influenced by a lower policy rate and increased productivity, though inflation is expected to rise due to tariffs.\n- Economists now predict the Federal Reserve will maintain current interest rates as inflation remains steady and the job market holds up.\n- Research highlights that a steep Phillips curve suggests inflation is more responsive to economic conditions than previously thought, indicating potential challenges for monetary policy.",
    "article_count": 21,
    "topicality": 21.0,
    "theme_weight": 1.0285714285714285,
    "theme": "Inflation"
  },
  "T11": {
    "topic_id": "T11",
    "bertopic_id": 11,
    "title": "Federal Reserve Decisions",
    "summary": "OVERVIEW:\nRecent announcements from the Federal Reserve Board reveal a series of approvals for bank applications and updates to policy statements, highlighting ongoing governance in the financial sector.\n\nKEY EXAMPLES:\n- Approval granted to National Bank Holdings Corporation for its application.\n- Approval granted to Banco Inter, S.A. for its application.\n- New policy statement issued to facilitate responsible innovation for Board-supervised banks.",
    "article_count": 20,
    "topicality": 20.0,
    "theme_weight": 1.13,
    "theme": "Bank lending and credit risk"
  },
  "T12": {
    "topic_id": "T12",
    "bertopic_id": 12,
    "title": "**Market Dynamics and Strategy**",
    "summary": "OVERVIEW:\nThe articles highlight various shifts in market strategies, including pricing pressures in the pharmaceutical sector, changing financial guidance from major firms, and strategic moves in private debt and acquisitions.\n\nKEY EXAMPLES:\n- Novo Nordisk is experiencing intense price pressures and competition as patents expire.\n- Novartis has raised its sales and profit forecasts for the year.\n- Goldman Sachs and Allianz are increasingly focusing on private debt consolidation strategies.\n- Beyond is set to acquire the Buy Buy Baby brand, aiming to merge it with Bed Bath & Beyond.",
    "article_count": 20,
    "topicality": 20.0,
    "theme_weight": 1.065,
    "theme": "Private credit"
  },
  "T13": {
    "topic_id": "T13",
    "bertopic_id": 13,
    "title": "Cryptocurrency Developments and Challenges",
    "summary": "OVERVIEW:\nThe cryptocurrency landscape is witnessing rapid growth alongside increasing regulatory challenges and concerns related to fraud and illicit activities. Key players are adapting to new compliance operations while grappling with the impact of geopolitical tensions and sophisticated scams.\n\nKEY EXAMPLES:\n- MoonPay enhances its compliance operations through a partnership with Chainalysis and Unit21 to navigate the evolving regulatory environment.\n- Chinese-language money laundering networks have emerged as significant facilitators of illicit crypto activity, accounting for 20% of laundering efforts.\n- The U.S. is poised for wider adoption of stablecoins, driven by legislative changes and their integration into global peer-to-peer payment systems.\n- US sanctions have targeted Iranian crypto exchanges, marking a significant action against digital asset firms facilitating transactions in Iran's financial sector.",
    "article_count": 17,
    "topicality": 17.0,
    "theme_weight": 0.8058823529411764,
    "theme": "Digital assets"
  },
  "T14": {
    "topic_id": "T14",
    "bertopic_id": 14,
    "title": "Federal Reserve Developments",
    "summary": "OVERVIEW:\nRecent news highlights significant changes and challenges facing the Federal Reserve, including a leadership transition and ongoing scrutiny from the Trump administration.\n\nKEY EXAMPLES:\n- President Trump nominated Kevin Warsh to replace Jerome H. Powell as chair of the Federal Reserve, signaling a potential shift in monetary policy direction.\n- The Trump administration has intensified criticisms of the Federal Reserve, including launching a criminal investigation into Jerome H. Powell's actions. \n- The minutes from key meetings outline discussions around monetary policy and the economic landscape as the transition in leadership approaches.",
    "article_count": 10,
    "topicality": 10.0,
    "theme_weight": 1.1,
    "theme": "Inflation"
  }
}