{
  "T0": {
    "topic_id": "T0",
    "bertopic_id": 0,
    "title": "Impact of Artificial Intelligence",
    "summary": "OVERVIEW:\nRecent advancements in artificial intelligence (AI) technology have sparked a mix of enthusiasm and concern across various sectors, from finance to labor markets. Despite the potential benefits of AI, the economic implications and disruptions it could cause continue to be a source of debate and unease.\n\nKEY EXAMPLES:\n- Wall Street experienced a sell-off due to fears surrounding AI's impact on the economy.\n- Big Tech's planned investments of $500 billion in AI could support struggling industries like Bitcoin mining.\n- Experts express a cautious optimism for AI development while warning of its potential to disrupt traditional economic systems. \n- Advances in AI have led to innovative trading tools that aim to simplify the financial landscape.",
    "article_count": 40,
    "topicality": 40.0,
    "theme_weight": 0.9925,
    "theme": "AI"
  },
  "T1": {
    "topic_id": "T1",
    "bertopic_id": 1,
    "title": "Cryptocurrency Market Volatility",
    "summary": "OVERVIEW:\nThe cryptocurrency market is experiencing significant volatility, characterized by notable price corrections in major digital assets like Bitcoin, XRP, TRX, and BNB, as investors reassess market fundamentals amid broader economic pressures.\n\nKEY EXAMPLES:\n- Bitcoin's price has recently dropped to $94,000 due to increasing risk aversion among investors.\n- Major cryptocurrencies are undergoing corrections in light of reduced speculative activity and macroeconomic challenges. \n- Speculative forecasts for Bitcoin reaching $200,000 by 2025 are now viewed as increasingly unrealistic.",
    "article_count": 35,
    "topicality": 35.0,
    "theme_weight": 0.8942857142857144,
    "theme": "Digital assets"
  },
  "T2": {
    "topic_id": "T2",
    "bertopic_id": 2,
    "title": "Cybersecurity Threats and Trends",
    "summary": "OVERVIEW:\nRecent news highlights the surge in cyber threats, particularly through botnets like Kimwolf, and emphasizes the evolving tactics employed by cybercriminals, including the integration of AI in attacks. The challenges of securing network devices and the vulnerabilities in software installations are also discussed.\n\nKEY EXAMPLES:\n- The Kimwolf botnet infected over two million devices, exploiting Android TV streaming boxes to rapidly grow.\n- A researcher noted that a third of newly exploited CVEs targeted edge devices, highlighting a shift in ransomware tactics.\n- Suspected state-sponsored attacks utilized software update mechanisms to deploy backdoored applications.\n- AI was leveraged by cybercriminals to automate attacks, such as exploiting exposed credentials from public storage buckets.",
    "article_count": 34,
    "topicality": 34.0,
    "theme_weight": 1.0058823529411764,
    "theme": "Cyber attacks"
  },
  "T3": {
    "topic_id": "T3",
    "bertopic_id": 3,
    "title": "Crypto Market Volatility",
    "summary": "OVERVIEW:\nThe cryptocurrency market is experiencing significant turmoil, with major assets like Bitcoin and Ethereum facing steep declines. This downturn has resulted in substantial financial distress for various crypto entities and investors.\n\nKEY EXAMPLES:\n- Bitcoin dipped to around $60,000, leading to over $2.56 billion in liquidations across crypto derivatives markets.\n- Ethereum's price fell below $2,000 amid significant sell-offs by high-profile investors, causing widespread market panic.\n- Many Bitcoin treasury companies reported combined unrealized losses approaching $10 billion due to the price drop.",
    "article_count": 32,
    "topicality": 32.0,
    "theme_weight": 0.821875,
    "theme": "Digital assets"
  },
  "T4": {
    "topic_id": "T4",
    "bertopic_id": 4,
    "title": "Trade Agreements and Tariffs",
    "summary": "OVERVIEW:\nRecent developments highlight the impact of tariffs and trade agreements on automotive industries and international economic relations, particularly focusing on the U.S., Canada, Europe, and India.\n\nKEY EXAMPLES:\n- Canada is seeking to strengthen its auto industry in response to tariffs imposed by the U.S., which threaten jobs and production.\n- The European Union is expanding its carbon trading system to include imports, aiming to reduce emissions-related structural challenges in manufacturing.\n- India's trade agreement with the U.S. aims to reduce duties on Indian products while promising significant purchases of U.S. goods.",
    "article_count": 31,
    "topicality": 31.0,
    "theme_weight": 0.996774193548387,
    "theme": "Inflation"
  },
  "T5": {
    "topic_id": "T5",
    "bertopic_id": 5,
    "title": "Legislative Updates Overview",
    "summary": "OVERVIEW:\nRecent reports from various House committees highlight significant legislative activities across financial services, transportation, and infrastructure, as well as taxation and energy sectors.\n\nKEY EXAMPLES:\n- The House Committee on Financial Services reported on multiple occasions, notably on June 20 and September 8, 2025.\n- The House Committee on Transportation and Infrastructure ordered multiple reports on January 21, 2026, focusing on infrastructure improvements.\n- The House Committee on Ways and Means published reports on January 7, 2026, addressing crucial taxation issues.\n- The House Committee on Energy and Commerce provided insights on legislative matters on January 30, 2026.",
    "article_count": 29,
    "topicality": 29.0,
    "theme_weight": 1.0758620689655172,
    "theme": "Inflation"
  },
  "T6": {
    "topic_id": "T6",
    "bertopic_id": 6,
    "title": "Economic Trends in Employment",
    "summary": "OVERVIEW:\nRecent articles highlight various economic indicators and challenges in the labor market, including job growth, impacts of government actions, and disparities in earnings.\n\nKEY EXAMPLES:\n- The Bureau of Labor Statistics released delayed employment data due to a government shutdown, showcasing the effects of political decisions on economic reporting.\n- The New York Fed's Economic Heterogeneity Indicators revealed the crucial role of small businesses in job creation, accounting for 63% of new private sector jobs since 2005.\n- A discussion on labor participation rates showed that workers with disabilities are still earning less than their peers, despite recent increases in their workforce participation.",
    "article_count": 28,
    "topicality": 28.0,
    "theme_weight": 1.0285714285714287,
    "theme": "Recessionary pressures"
  },
  "T7": {
    "topic_id": "T7",
    "bertopic_id": 7,
    "title": "**Economic Outlook and Inflation**",
    "summary": "OVERVIEW:  \nRecent articles highlight a steady inflation rate coupled with a stable job market, influencing expectations around the Federal Reserve's interest rate policies. Economic forecasts point to stronger growth in 2025 within a context of shifting inflation dynamics.\n\nKEY EXAMPLES:  \n- Economists anticipate the Federal Reserve will maintain current interest rates due to stable inflation and job conditions.  \n- The Federal Reserve Bank of New York's model predicts stronger economic growth in 2025 due to lower policy rates and increased productivity, despite rising inflation projections driven by cost-push shocks.  \n- Evidence suggests that the Phillips curve remains steep, indicating that inflation responds significantly to economic conditions, impacting monetary policy decisions.  \n- Political pressures are mounting, particularly from President Trump, as the Federal Reserve faces scrutiny over its rate cut decisions.",
    "article_count": 27,
    "topicality": 27.0,
    "theme_weight": 1.0296296296296297,
    "theme": "Inflation"
  },
  "T8": {
    "topic_id": "T8",
    "bertopic_id": 8,
    "title": "Federal Reserve Actions Overview",
    "summary": "OVERVIEW:\nThe Federal Reserve Board has recently undertaken a series of initiatives, including the approval of various banking applications and the issuance of new policy statements aimed at enhancing regulations and fostering responsible innovation within the financial sector.\n\nKEY EXAMPLES:\n- The approval of applications for National Bank Holdings Corporation and Banco Inter, S.A.\n- The withdrawal of a 2023 policy statement and the introduction of a new one regarding Board-supervised banks.\n- The request for public input on a new type of payment account for eligible financial institutions.",
    "article_count": 26,
    "topicality": 26.0,
    "theme_weight": 1.1153846153846154,
    "theme": "Bank lending and credit risk"
  },
  "T9": {
    "topic_id": "T9",
    "bertopic_id": 9,
    "title": "Market Performance Divergence",
    "summary": "OVERVIEW:\nRecent financial reports highlight contrasting performances among companies and stock market indices, showcasing both positive growth and disappointing earnings. While some firms raise their forecasts, others face significant stock declines, indicating mixed investor sentiment.\n\nKEY EXAMPLES:\n- Plus500 reports an 11% increase in quarterly revenue and expects to meet its financial goals.\n- Wingstop's stock fell by 12% after profits did not meet expectations.\n- Novartis increases its sales and profit guidance for the year amid positive financial outlooks.\n- The S&P 500's positioning is at record highs, with warnings of potential pullbacks from analysts.",
    "article_count": 23,
    "topicality": 23.0,
    "theme_weight": 1.0391304347826087,
    "theme": "Recessionary pressures"
  },
  "T10": {
    "topic_id": "T10",
    "bertopic_id": 10,
    "title": "Evolving Financial Strategies",
    "summary": "OVERVIEW:\nRecent developments highlight a trend of companies in the financial sector shifting their strategies towards innovation and adaptation in response to market changes. Key players are focusing on diversifying their services and embracing new technologies.\n\nKEY EXAMPLES:\n- Japan's top dealer is pursuing a global strategy by moving away from risk warehousing and targeting real money clients.\n- Bitfarms has rebranded to focus on AI, abandoning its previous focus as a 'bitcoin company', leading to a surge in its shares.\n- Ondo is aiming to innovate in prime brokerage by building on-chain solutions, starting with perpetual contracts.",
    "article_count": 22,
    "topicality": 22.0,
    "theme_weight": 0.9409090909090909,
    "theme": "Digital assets"
  },
  "T11": {
    "topic_id": "T11",
    "bertopic_id": 11,
    "title": "Currency Fluctuations in Asia",
    "summary": "OVERVIEW:\nRecent developments indicate a mixed performance of Asian currencies against the U.S. dollar, influenced by upcoming central bank meetings and investor sentiment towards safe havens.\n\nKEY EXAMPLES:\n- The Asian FX market is experiencing declines as the dollar strengthens ahead of key ECB and BoE meetings.\n- The Japanese yen remains fragile as it faces pressures from upcoming elections.\n- Investors are gravitating towards safe havens, leading to increased strength in the Yen and Swiss Franc against the dollar following turbulence in U.S. tech stocks.",
    "article_count": 22,
    "topicality": 22.0,
    "theme_weight": 0.9545454545454544,
    "theme": "Inflation"
  },
  "T12": {
    "topic_id": "T12",
    "bertopic_id": 12,
    "title": "Wealth Disparities and Political Maneuvering",
    "summary": "OVERVIEW:\nRecent articles highlight issues surrounding racial wealth disparities and the shifting political landscape impacting public trust and social equity. They examine historical patterns of wealth extraction from Black communities and discuss contemporary political actions that may further complicate these issues.\n\nKEY EXAMPLES:\n- Clyburn’s recounting of the strategies used to undermine Black wealth reveals a persistent historical narrative affecting current socio-economic conditions.\n- The Trump administration's recent policy changes threaten to undermine fundamental rights and capabilities aimed at addressing technology-related challenges, potentially impacting social equity.\n- In the realm of health access, Hims & Hers' marketing of a cancer-detection test sheds light on the inequality in healthcare availability, particularly in the context of wealth.",
    "article_count": 21,
    "topicality": 21.0,
    "theme_weight": 0.9952380952380951,
    "theme": "Others"
  },
  "T13": {
    "topic_id": "T13",
    "bertopic_id": 13,
    "title": "Global Crypto Developments",
    "summary": "OVERVIEW: Recent articles highlight significant advancements and challenges in the global cryptocurrency landscape, including regulatory actions, emerging threats, and market growth influenced by geopolitical factors.\n\nKEY EXAMPLES:\n- MoonPay partners with Chainalysis and Unit21 to enhance compliance operations amidst rising crypto adoption.\n- Chinese-language money laundering networks now account for 20% of all crypto laundering activities.\n- Iran's crypto market has reached $7.78 billion, influenced by geopolitical tensions and domestic unrest.  \n- The People's Bank of China has expanded its crackdown on stablecoins and asset tokenization.  \n- The U.S. is witnessing a potential surge in payment stablecoins due to new legislation promoting broader adoption.  \n- Crypto-enabled fraud caused at least $14 billion in losses globally in 2025, prompting calls for enhanced regulatory measures, particularly from the UK.",
    "article_count": 20,
    "topicality": 20.0,
    "theme_weight": 0.7999999999999998,
    "theme": "Digital assets"
  },
  "T14": {
    "topic_id": "T14",
    "bertopic_id": 14,
    "title": "**Tourism and Travel Trends**",
    "summary": "OVERVIEW:\nRecent news highlights significant developments in tourism dynamics in both Hong Kong and China, emphasizing crowd management for increased visitor numbers and emerging trends among travelers, including unique experiences and the rise of senior influencers.\n\nKEY EXAMPLES:\n- Hong Kong is enhancing crowd control measures at hiking spots for a surge in tourists during the Lunar New Year, anticipating 1.43 million visitors.\n- China sees a trend of foreign travelers seeking medical treatment, spurred by online experiences shared by influencers.\n- The emergence of \"granfluencers\" in China reflects a growing engagement of seniors in social media, contributing millions of posts and redefining digital interactions.",
    "article_count": 17,
    "topicality": 17.0,
    "theme_weight": 0.9764705882352942,
    "theme": "Others"
  }
}