{
  "T0": {
    "topic_id": "T0",
    "bertopic_id": 0,
    "title": "Federal Reserve Approvals and Policies",
    "summary": "OVERVIEW:\nThe Federal Reserve Board is engaged in a series of actions that include the approval of several banking applications and updates to policy statements that encourage innovation in the banking sector. These developments reflect the Fed's ongoing efforts to adapt to changes in the financial landscape.\n\nKEY EXAMPLES:\n- The Federal Reserve approved applications from National Bank Holdings Corporation and Banco Inter, S.A.\n- A new policy statement was released to guide the treatment of certain Board-supervised banks, promoting responsible innovation.\n- The Fed sought public input on payment accounts designed for eligible financial institutions for payment clearing and settlement.",
    "article_count": 45,
    "topicality": 45.0,
    "theme_weight": 1.1111111111111114,
    "theme": "Bank lending and credit risk"
  },
  "T1": {
    "topic_id": "T1",
    "bertopic_id": 1,
    "title": "Trade Tensions and Tariffs",
    "summary": "OVERVIEW: The ongoing trade tensions initiated by President Trump's policies, particularly related to potential tariffs on European allies and the controversial idea of purchasing Greenland, have sparked economic uncertainty and reactions from both investors and foreign governments.\n\nKEY EXAMPLES:\n- Trump announced that European nations opposing his Greenland acquisition plan would face 10% tariffs starting in February.\n- Following Trump's tariff threats, investors shifted towards precious metals as a safe haven.\n- European countries are rapidly discussing their responses to Trump's tariff threats, indicating rising international trade concerns.",
    "article_count": 40,
    "topicality": 40.0,
    "theme_weight": 0.9324999999999999,
    "theme": "Inflation"
  },
  "T2": {
    "topic_id": "T2",
    "bertopic_id": 2,
    "title": "Cybersecurity Challenges 2026",
    "summary": "OVERVIEW:  \nThe recent year has highlighted significant cybersecurity threats and breaches, with increasing incidents of hacking, social engineering, and exploitation of vulnerabilities impacting both individuals and organizations globally.\n\nKEY EXAMPLES:  \n- The Kimwolf botnet infected over two million devices through compromised Android TV streaming boxes.  \n- A massive data dump disclosed identities of members from a key hacker forum.  \n- Hackers targeted Iranian state television, showcasing the interplay between cybercrime and social unrest.  \n- A phishing campaign exemplified attackers' use of legitimate services to conduct cyberattacks undetected.",
    "article_count": 38,
    "topicality": 38.0,
    "theme_weight": 1.0,
    "theme": "Cyber attacks"
  },
  "T3": {
    "topic_id": "T3",
    "bertopic_id": 3,
    "title": "AI Investment and Impact",
    "summary": "OVERVIEW:\nRecent articles highlight the expanding influence of artificial intelligence across various sectors, illustrating both the growth in investment and the accompanying concerns regarding its integration and risks.\n\nKEY EXAMPLES:\n- Venture-capital firms are investing in AI technologies for traditionally less glamorous fields like accounting and property management.\n- Concerns have been raised by economists about potential corrections in AI investments despite the current boom supporting global economic output.\n- Integrating AI into hiring practices within Big Tech is transforming recruitment processes, according to industry experts.",
    "article_count": 32,
    "topicality": 32.0,
    "theme_weight": 0.996875,
    "theme": "AI"
  },
  "T4": {
    "topic_id": "T4",
    "bertopic_id": 4,
    "title": "Legislative Committee Reports",
    "summary": "OVERVIEW:\nRecent articles highlight various legislative actions taken by different House and Senate committees regarding pending bills. These reports indicate ongoing legislative activity as committees review and prepare legislation for further consideration.\n\nKEY EXAMPLES:\n- The House Committee on Financial Services reported a bill on December 17, 2025.\n- Two reports from the House Committee on Energy and Commerce were issued on December 3, 2025.\n- The Senate Committee on Commerce, Science, and Transportation reported a bill on October 21, 2025.",
    "article_count": 30,
    "topicality": 30.0,
    "theme_weight": 1.01,
    "theme": "Others"
  },
  "T5": {
    "topic_id": "T5",
    "bertopic_id": 5,
    "title": "Market Trends and Investments",
    "summary": "OVERVIEW:\nThe articles highlight current trends in the investment landscape, including potential IPOs from tech companies, shifts in telecom data plans, and movements in the real estate sector.\n\nKEY EXAMPLES:\n- SpaceX, OpenAI, and Anthropic may soon go public, potentially generating significant capital for investors.\n- China-based phishing groups have adapted their scams for the holiday season by offering phishing kits for fake e-commerce sites.\n- Verizon's return to unlimited data plans illustrates the highly competitive nature of the telecom market, impacting stock performance negatively.\n- Investors are actively purchasing prime real estate in Hong Kong, signifying selective investments despite market pressures.",
    "article_count": 28,
    "topicality": 28.0,
    "theme_weight": 1.0464285714285715,
    "theme": "Others"
  },
  "T6": {
    "topic_id": "T6",
    "bertopic_id": 6,
    "title": "Economic Forecasts and Trends",
    "summary": "OVERVIEW:\nThe articles collectively highlight updates and analyses on the U.S. economic forecasts for 2025, discussing the factors influencing growth, inflation, labor market conditions, and manufacturing trends.\n\nKEY EXAMPLES:\n- The Federal Reserve Bank of New York's DSGE model predicts stronger growth in 2025, influenced by lower policy rates and higher productivity, but with rising inflation due to tariff-related cost-push shocks (Article 1).\n- A significant year of focus in 2025 included economic challenges related to tariffs, trade tensions, and financial pressures on younger adults, capturing widespread interest among readers (Article 3).\n- The unemployment rate decreased in December, yet job growth over the year was at its lowest level in five years, indicating a complex labor market scenario (Article 7).",
    "article_count": 27,
    "topicality": 27.0,
    "theme_weight": 1.0,
    "theme": "Recessionary pressures"
  },
  "T7": {
    "topic_id": "T7",
    "bertopic_id": 7,
    "title": "Market Volatility and Economic Policy",
    "summary": "OVERVIEW:\nRecent news articles highlight the impact of economic policy changes, particularly concerning tariffs and the Federal Reserve's actions, on market conditions, including significant fluctuations in stock and cryptocurrency prices.\n\nKEY EXAMPLES:\n- Bitcoin fell to $94,000 amid concerns over tariffs introduced by Trump.\n- The stock market achieved record highs attributed to optimism surrounding Trump's Treasury appointment.\n- The Nasdaq faced declines, particularly among AI infrastructure companies like Nvidia which dropped 16%.\n- Gold prices hit record highs as investors shifted to safer assets in light of tariff fears.",
    "article_count": 26,
    "topicality": 26.0,
    "theme_weight": 0.9615384615384616,
    "theme": "Recessionary pressures"
  },
  "T8": {
    "topic_id": "T8",
    "bertopic_id": 8,
    "title": "Housing Affordability Challenges",
    "summary": "OVERVIEW:\nRecent discussions around housing in the U.S. highlight growing affordability issues and proposed solutions, including financial support mechanisms. The focus on homeownership costs reflects broader economic concerns and governmental responses to help struggling individuals.\n\nKEY EXAMPLES:\n- A proposal allowing Americans to use 401(k)s for home down payments was mentioned by a Trump economic adviser.\n- The Biden administration is considering various strategies to address housing affordability at an upcoming economic conference.\n- The financial burdens of owning homes in flood and wildfire-prone areas are becoming increasingly recognized as part of the housing affordability crisis.",
    "article_count": 25,
    "topicality": 25.0,
    "theme_weight": 1.048,
    "theme": "Consumer debt"
  },
  "T9": {
    "topic_id": "T9",
    "bertopic_id": 9,
    "title": "Crypto Market Developments",
    "summary": "OVERVIEW:\nRecent news highlights significant developments in the cryptocurrency market, including regulatory challenges, price fluctuations of Bitcoin, and major institutional investments. Analysts express concerns about overregulation while contrasting Bitcoin's performance with other assets like gold.\n\nKEY EXAMPLES:\n- Michaël van de Poppe highlights that overregulation could harm decentralized finance (DeFi) and impact the crypto industry negatively.\n- Bitcoin's price experienced a drop of 3.6% as gold futures hit record highs amid geopolitical tensions.\n- Michael Saylor's firm purchased 14,910 Bitcoin, increasing their total holdings to over 687,000 Bitcoin, showcasing institutional interest in the asset.",
    "article_count": 23,
    "topicality": 23.0,
    "theme_weight": 0.7999999999999998,
    "theme": "Digital assets"
  },
  "T10": {
    "topic_id": "T10",
    "bertopic_id": 10,
    "title": "** Bitcoin Market Trends",
    "summary": "**OVERVIEW:**  \nRecent analyses and predictions highlight a bullish outlook for Bitcoin and the cryptocurrency market, emphasizing increasing investments, significant ETF inflows, and rising confidence among large holders and institutional investors.\n\n**KEY EXAMPLES:**  \n- Investor Dan Tapiero predicts Bitcoin could reach $180,000 and expects stablecoins to surge in 2026.  \n- A recent inflow of $1.2 billion into Bitcoin ETFs has been seen as a strong bullish signal for the market.  \n- Strategy’s Michael Saylor plans to make more Bitcoin purchases following a $1.25 billion acquisition spree.  \n- Large Bitcoin holders have begun purchasing at levels not seen since the aftermath of the FTX collapse in 2022.",
    "article_count": 23,
    "topicality": 23.0,
    "theme_weight": 0.834782608695652,
    "theme": "Digital assets"
  },
  "T11": {
    "topic_id": "T11",
    "bertopic_id": 11,
    "title": "Crypto Market Developments 2025",
    "summary": "OVERVIEW:\nIn 2025, the cryptocurrency landscape experienced significant shifts, marked by rising nation-state involvement, heightened regulation, and alarming trends in scams and fraud. These developments reflect the evolving nature of the crypto market amidst increasingly complex geopolitical and economic pressures.\n\nKEY EXAMPLES:\n- Nation-state activity in crypto surged, with reports of crypto crime reaching record highs as tactics for evading sanctions evolved.\n- Iran's crypto ecosystem grew to over $7.8 billion, driven by domestic unrest and geopolitical tensions.\n- An estimated $17 billion was lost to crypto scams and fraud in 2025, primarily due to advanced impersonation scams utilizing AI.\n- Regulatory efforts, such as the Blockchain Regulatory Certainty Act, aim to clarify the legal status of blockchain developers in the face of stringent financial regulations.",
    "article_count": 22,
    "topicality": 22.0,
    "theme_weight": 0.7999999999999997,
    "theme": "Digital assets"
  },
  "T12": {
    "topic_id": "T12",
    "bertopic_id": 12,
    "title": "Corporate Earnings and Market Outlook",
    "summary": "OVERVIEW:\nRecent corporate reports indicate a positive trend in earnings and guidance among several companies, while analysts express cautious sentiments regarding future market conditions.\n\nKEY EXAMPLES:\n- Plus500 anticipates meeting expectations following an 11% revenue increase in the last quarter.\n- Novartis has raised its sales and profit guidance for the year, reflecting strong performance.\n- Barclays reported an 18% rise in profits and has also lifted its income guidance.\n- Deutsche Bank is forecasting the S&P 500 to reach 7000 by the end of 2025, despite warnings of a 'murky' macro outlook for the US.",
    "article_count": 21,
    "topicality": 21.0,
    "theme_weight": 1.0047619047619047,
    "theme": "Inflation"
  },
  "T13": {
    "topic_id": "T13",
    "bertopic_id": 13,
    "title": "Price Inflation and Economic Factors",
    "summary": "OVERVIEW:\nThe articles collectively explore the complexities of price inflation, highlighting various factors affecting pricing decisions across industries and the influence of quality adjustments. They illustrate how pricing dynamics are influenced by external pressures such as tariffs, demand fluctuations, and competitive behavior.\n\nKEY EXAMPLES:\n- A novel method reveals that official measures of import price inflation may overstate costs, as quality improvements mean consumers receive better value for money.\n- Businesses are navigating a complex landscape of pricing strategies influenced by inflation, competition, and demand conditions, as evidenced by interviews with senior decision-makers.\n- Significant price increases have been observed in commodities like beef, coffee, and produce, indicating broader inflation trends.\n- The U.S. government has threatened tariffs on foreign memory chip manufacturers, raising concerns about potential shortages and their impact on prices.",
    "article_count": 20,
    "topicality": 20.0,
    "theme_weight": 1.01,
    "theme": "Inflation"
  },
  "T14": {
    "topic_id": "T14",
    "bertopic_id": 14,
    "title": "Media Tensions Under Trump",
    "summary": "OVERVIEW:\nRecent developments highlight the Trump administration's contentious relationship with media organizations, characterized by threats of legal action and accusations of censorship. These tensions underscore broader concerns regarding free speech and the media's role in democracy.\n\nKEY EXAMPLES:\n- The administration's policy pivots have created challenges for addressing technology issues like cybersecurity and disinformation.\n- The White House press secretary indicated plans to sue a news outlet if it did not air an unedited interview.\n- Bari Weiss's intervention in a \"60 Minutes\" interview raised accusations of corporate censorship.\n- The president has also made promises regarding exclusive broadcasting rights, indicating a focus on controlling media narratives.",
    "article_count": 18,
    "topicality": 18.0,
    "theme_weight": 1.0,
    "theme": "Others"
  }
}