{
  "T0": {
    "topic_id": "T0",
    "bertopic_id": 0,
    "title": "Stock Market Reactions",
    "summary": "OVERVIEW:\nRecent news highlights volatility in the stock market, particularly in reaction to earnings reports and economic indicators affecting key companies. Investors are reacting to mixed financial results, with some companies exceeding expectations while others fall short.\n\nKEY EXAMPLES:\n- Wingstop's stock dropped 12% after its profit failed to meet estimates.\n- A major tech company reported $81.3 billion in revenue but saw its share price decline over 7% in after-hours trading.\n- Nvidia shares plummeted 16%, contributing to declines in AI infrastructure stocks amid heightened scrutiny of AI costs.",
    "article_count": 43,
    "topicality": 43.0,
    "theme_weight": 0.9790697674418607,
    "theme": "Inflation"
  },
  "T1": {
    "topic_id": "T1",
    "bertopic_id": 1,
    "title": "Cybersecurity Threats and Botnets",
    "summary": "OVERVIEW:\nRecent reports highlight the alarming rise of advanced cybersecurity threats, particularly focusing on the Kimwolf botnet, which has compromised millions of devices and poses significant risks to organizations, including government and corporate networks.\n\nKEY EXAMPLES:\n- Kimwolf has infected over 2 million devices, enabling them to participate in DDoS attacks and spread further malware within local networks.\n- The rise of tactics such as data-leak extortion and AI-driven cyberattacks highlights the growing complexity of threats facing organizations today.\n- There are ongoing vulnerabilities within popular operating systems that risk exposing users to these sophisticated cyber threats.",
    "article_count": 39,
    "topicality": 39.0,
    "theme_weight": 0.9974358974358974,
    "theme": "Cyber attacks"
  },
  "T2": {
    "topic_id": "T2",
    "bertopic_id": 2,
    "title": "Federal Reserve Developments",
    "summary": "OVERVIEW:\nRecent actions by the Federal Reserve Board highlight its ongoing efforts to adapt policies and regulations in response to evolving financial landscapes, particularly concerning payment systems, regulatory frameworks, and the integration of nonbank financial institutions.\n\nKEY EXAMPLES:\n- The Federal Reserve Board is seeking public input on a \"payment account\" system for eligible financial institutions to facilitate payment clearing and settling.\n- New policy statements have been issued to encourage responsible innovation among Board-supervised banks, replacing an earlier 2023 statement.\n- The approval of applications for Banco Inter, S.A., Fifth Third Bancorp, and National Bank Holdings Corporation showcases regulatory movements within the banking sector.\n- Discussions on the evolution of banks highlight their expansion into nonbank activities, indicating a shift from traditional deposit-taking and loan-making functions.",
    "article_count": 35,
    "topicality": 35.0,
    "theme_weight": 1.1485714285714288,
    "theme": "Bank lending and credit risk"
  },
  "T3": {
    "topic_id": "T3",
    "bertopic_id": 3,
    "title": "Crypto Market Developments",
    "summary": "OVERVIEW:\nRecent trends in the cryptocurrency space reveal a mix of investor behaviors, regulatory changes, and market dynamics as traditional assets gain traction among crypto holders amid tumultuous market conditions.\n\nKEY EXAMPLES:\n- XRP wallets exceeding 1 million tokens are increasing, signaling potential confidence despite poor market sentiment.\n- South Korea's regulatory changes enhance oversight of crypto exchanges and their shareholders to ensure safer market practices.\n- Crypto whales are increasingly investing in gold, highlighting a shift in strategy as Bitcoin experiences price stagnation.",
    "article_count": 33,
    "topicality": 33.0,
    "theme_weight": 0.7909090909090909,
    "theme": "Digital assets"
  },
  "T4": {
    "topic_id": "T4",
    "bertopic_id": 4,
    "title": "Impact of Tariffs on Trade",
    "summary": "OVERVIEW:\nThe articles discuss the implications of tariffs on both US companies and international trade dynamics, highlighting the mixed effects these measures have on domestic and foreign markets.\n\nKEY EXAMPLES:\n- Tariffs are seen to protect some companies but often adversely affect the availability of parts and materials needed by factories to produce finished goods.\n- President Trump has threatened to raise tariffs on South Korean exports, emphasizing the political ramifications of trade negotiations. \n- The moderation of US international trade since 2011 suggests a shifting landscape that impacts exports and economic relations.",
    "article_count": 32,
    "topicality": 32.0,
    "theme_weight": 0.95,
    "theme": "Inflation"
  },
  "T5": {
    "topic_id": "T5",
    "bertopic_id": 5,
    "title": "Federal Reserve's Rate Policy",
    "summary": "OVERVIEW:\nThe Federal Reserve has decided to pause rate cuts amid pressure from President Trump and a stable economic environment marked by steady inflation and a resilient job market.\n\nKEY EXAMPLES:\n- The Federal Reserve's decision to hold rates comes after three cuts last year, as officials seek clearer signs of cooling inflation.\n- Economists predict the Fed will maintain current interest rates due to elevated but steady inflation and a robust job market.\n- Concerns voiced by President Trump about the pace of rate cuts have intensified as the central bank holds its position.",
    "article_count": 30,
    "topicality": 30.0,
    "theme_weight": 1.0133333333333332,
    "theme": "Inflation"
  },
  "T6": {
    "topic_id": "T6",
    "bertopic_id": 6,
    "title": "AI Investment Trends",
    "summary": "OVERVIEW:\nRecent news highlights the fluctuating interest and significant investment in artificial intelligence across various industries, indicating both opportunities and challenges in the sector.\n\nKEY EXAMPLES:\n- Venture-capital firms are integrating AI into traditionally unglamorous sectors like accounting and property management.\n- Meta and Microsoft are ramping up their AI expenditures, while investment in AI-related companies continues to capture attention, exemplified by a major funding round in an AI start-up.\n- The automaker's $2 billion investment in xAI underlines the ongoing trend of prominent companies committing substantial resources to AI advancements.",
    "article_count": 27,
    "topicality": 27.0,
    "theme_weight": 0.9962962962962962,
    "theme": "AI"
  },
  "T7": {
    "topic_id": "T7",
    "bertopic_id": 7,
    "title": "Pet Economy Growth in Hong Kong",
    "summary": "OVERVIEW:\nThe recent Hong Kong Pet Show highlights the burgeoning pet economy, showcasing innovative products and services aimed at enhancing pet ownership. Concurrently, the proposal for dog-friendly restaurants signifies a notable cultural shift in the city’s dining landscape.\n\nKEY EXAMPLES:\n- The Hong Kong Pet Show featured novel products like AI-powered cat litter boxes and fresh dog food inspired by local cuisine, indicating a strong market for luxury pet items.\n- Hong Kong's environment minister announced plans to approve dog-friendly restaurants by 2026, which is set to transform local dining regulations and support the pet economy.",
    "article_count": 27,
    "topicality": 27.0,
    "theme_weight": 0.988888888888889,
    "theme": "Others"
  },
  "T8": {
    "topic_id": "T8",
    "bertopic_id": 8,
    "title": "Tech Industry Trends",
    "summary": "OVERVIEW:\nRecent developments in the tech industry highlight ongoing investment, strategic shifts, and market challenges. Companies are focusing on expansion, job creation, and competitive strategies while navigating investor concerns and market dynamics.\n\nKEY EXAMPLES:\n- Nvidia has been cleared to establish a $105 million headquarters in Taiwan, underscoring its commitment to the booming AI sector.\n- Verizon is reintroducing unlimited data plans, a move that benefits consumers but poses risks to its stock amidst fierce competition.\n- Major chipmakers like TSMC are experiencing increased demand despite fears of a market bubble.",
    "article_count": 25,
    "topicality": 25.0,
    "theme_weight": 1.004,
    "theme": "AI"
  },
  "T9": {
    "topic_id": "T9",
    "bertopic_id": 9,
    "title": "Dollar Weakness and Crypto Response",
    "summary": "OVERVIEW:\nRecent market trends indicate a significant decline in the US dollar, reaching a four-year low, while gold and silver prices have soared. This economic backdrop is creating a volatile environment for cryptocurrency, particularly Bitcoin, as investors navigate shifting risk appetites.\n\nKEY EXAMPLES:\n- The US dollar index fell to its lowest level since February 2022, prompting speculation about Bitcoin's potential role amidst the surge in gold and silver prices.\n- Despite the plunge of the dollar, Bitcoin's price recently slipped to $94,000 as concerns over economic stability and tariff threats emerged.\n- HSBC has advised investors to adopt a \"risk-on\" approach, favoring equities and gold, which may influence Bitcoin's next market movement.",
    "article_count": 24,
    "topicality": 24.0,
    "theme_weight": 0.8708333333333332,
    "theme": "Inflation"
  },
  "T10": {
    "topic_id": "T10",
    "bertopic_id": 10,
    "title": "Economic Challenges of 2025",
    "summary": "OVERVIEW:\nThe articles discuss the various economic challenges faced in 2025, focusing on trade tensions, rising costs of living, and impacts on younger populations. The analysis covers issues from tariffs and financial pressures to housing costs and job market trends.\n\nKEY EXAMPLES:\n- Economists at the New York Fed highlighted important research on trade deficits and the restoration of student loan data affecting borrowers' credit scores.\n- Developing economies are experiencing heightened borrowing costs that threaten public spending and raise broader economic concerns.\n- Insights into the increasing financial risks associated with housing in areas prone to flooding and wildfires.\n- Predictions from Deutsche Bank describe the US macroeconomic outlook as \"murky at best\" for the year.",
    "article_count": 23,
    "topicality": 23.0,
    "theme_weight": 1.034782608695652,
    "theme": "Consumer debt"
  },
  "T11": {
    "topic_id": "T11",
    "bertopic_id": 11,
    "title": "**Dollar Performance and Fed Impacts**",
    "summary": "OVERVIEW:\nRecent articles highlight the fluctuation and stabilization of the U.S. dollar amid decisions by the Federal Reserve to hold interest rates steady. Market responses indicate a mix of uncertainty and cautious behavior among investors.\n\nKEY EXAMPLES:\n- The dollar recovers as Bessent rules out intervention in currency markets, while the Federal Reserve maintains its current rate policy.\n- Following the Fed's rate hold, the yen and Swiss Franc gained strength as safe havens, influenced by external market factors like AI developments affecting U.S. tech stocks.\n- The dollar remains resilient against the euro and yen, maintaining steady performance amidst mixed economic signals and investor sentiment.",
    "article_count": 23,
    "topicality": 23.0,
    "theme_weight": 0.9652173913043478,
    "theme": "Inflation"
  },
  "T12": {
    "topic_id": "T12",
    "bertopic_id": 12,
    "title": "Legislative Committee Actions",
    "summary": "OVERVIEW:\nMultiple legislative actions are being reported by various committees within the House and Senate, indicating ongoing efforts to address significant issues through formal resolutions and reports.\n\nKEY EXAMPLES:\n- The House Committee on the Judiciary reported on two separate occasions, on December 18 and November 20, 2025.\n- The House Committee on Foreign Affairs provided multiple reports on January 21, 2026.\n- The Senate Committee on the Judiciary reported on January 15, 2026.\n- The House Committee on Oversight and Government Reform reported twice on December 2, 2025.",
    "article_count": 21,
    "topicality": 21.0,
    "theme_weight": 1.0,
    "theme": "Cyber attacks"
  },
  "T13": {
    "topic_id": "T13",
    "bertopic_id": 13,
    "title": "Crypto Fraud and Scams Surge**",
    "summary": "**OVERVIEW:**\nRecent reports highlight a significant increase in crypto-related fraud and scams, estimating that victims lost as much as $17 billion globally in 2025 due to various sophisticated techniques, including impersonation scams and phishing attacks.\n\n**KEY EXAMPLES:**\n- Victims faced losses exceeding $14 billion due to crypto-enabled fraud, with complex schemes like pig butchering being particularly prevalent.\n- Chinese-language money laundering networks have emerged as key players in the illicit crypto economy, orchestrating around 20% of crypto money laundering activities.\n- Impersonation scams have skyrocketed 1400%, contributing to a record estimated theft of $17 billion in crypto scams and fraud.\n- Phishing groups in China are reportedly creating fake e-commerce websites to steal payment card data during the holiday shopping season.",
    "article_count": 20,
    "topicality": 20.0,
    "theme_weight": 0.9349999999999999,
    "theme": "Digital assets"
  },
  "T14": {
    "topic_id": "T14",
    "bertopic_id": 14,
    "title": "Journalism and Tech Challenges",
    "summary": "OVERVIEW:\nThe articles highlight the evolving landscape of journalism and the tech industry, emphasizing the need for credible information and the challenges faced by both sectors in the current climate.\n\nKEY EXAMPLES:\n- CBS News is re-evaluating its journalism approach by introducing new contributors to better meet audience demands.\n- Apple CEO Tim Cook calls for action against the spread of fake news, highlighting concerns over misinformation in tech.\n- The tech industry faces increasing layoffs and a scarcity of job opportunities, contrasting with previous years of abundant employment.",
    "article_count": 18,
    "topicality": 18.0,
    "theme_weight": 1.011111111111111,
    "theme": "Others"
  }
}