{
  "T0": {
    "topic_id": "T0",
    "bertopic_id": 0,
    "title": "**Crypto Market Transformation**",
    "summary": "OVERVIEW:  \nThe cryptocurrency landscape in 2025 has witnessed significant changes, characterized by a shift towards institutional dominance, poor performance of new tokens, reduced retail interest, and a general decline in market activity.\n\nKEY EXAMPLES:  \n- Over 80% of newly launched tokens in 2025 are trading below their initial valuations, indicating a lack of interest from crypto insiders and creating challenges for retail investors.  \n- Bitcoin and Ethereum, despite some structural strength and institutional absorption, have struggled to maintain vibrancy, with Bitcoin remaining stagnant and Ethereum losing visibility amidst declining retail activity.  \n- A record $8.6 billion in crypto mergers and acquisitions suggests significant consolidation and a strategic shift within the industry, highlighting a changing focus towards larger entities and institutional players.",
    "article_count": 42,
    "topicality": 42.0,
    "theme_weight": 0.7785714285714287,
    "theme": "Digital assets"
  },
  "T1": {
    "topic_id": "T1",
    "bertopic_id": 1,
    "title": "U.S. Economic Developments",
    "summary": "OVERVIEW:\nRecent developments in U.S. economic policy and market behavior reveal a complex interplay of interest rates, trade dynamics, and currency fluctuations, especially as global uncertainties emerge.\n\nKEY EXAMPLES:\n- The U.S. dollar has experienced fluctuations, falling ahead of significant economic data releases while the Japanese yen surged amid intervention threats.\n- In 2025, the Federal Reserve cut interest rates, contributing to changes in the U.S. Treasury securities market's liquidity amidst rising economic policy uncertainty.\n- The monthly trade deficit dropped to a five-year low due to the president's global tariffs, though future trends remain uncertain.",
    "article_count": 41,
    "topicality": 41.0,
    "theme_weight": 0.9829268292682928,
    "theme": "Inflation"
  },
  "T2": {
    "topic_id": "T2",
    "bertopic_id": 2,
    "title": "Competition for AI Talent",
    "summary": "OVERVIEW:\nMajor tech companies, including OpenAI, Nvidia, and Google DeepMind, are aggressively investing in talent acquisition and new technologies to enhance their capabilities in artificial intelligence.\n\nKEY EXAMPLES:\n- OpenAI, Anthropic, Google DeepMind, and Meta are all competing to attract top talent in AI.\n- Nvidia plans to license Groq's technology and hire its executives to strengthen its position in AI chip manufacturing. \n- Former SpaceX employees are launching startups in various sectors, including AI, fueled by substantial venture capital.",
    "article_count": 38,
    "topicality": 38.0,
    "theme_weight": 0.9921052631578948,
    "theme": "AI"
  },
  "T3": {
    "topic_id": "T3",
    "bertopic_id": 3,
    "title": "**Tech Regulation and Geopolitics**",
    "summary": "OVERVIEW:  \nRecent developments highlight the interplay between technology, national security, and regulatory policies, particularly under the Trump administration, which has tightened its stance on foreign influence and tech oversight.\n\nKEY EXAMPLES:\n- Coupang's lobbying efforts in the U.S. have drawn Republican support amidst criticism of South Korea's investigation into the firm, overshadowed by its significant user data breach.\n- The Trump administration imposed travel bans on experts addressing issues like disinformation and foreign influence in technology, citing concerns over censorship and regulatory scrutiny.\n- North Korea has adapted its cyber strategies to target higher-profile individuals and organizations, emphasizing the evolving threats in the cyber landscape.",
    "article_count": 37,
    "topicality": 37.0,
    "theme_weight": 0.9891891891891892,
    "theme": "Others"
  },
  "T4": {
    "topic_id": "T4",
    "bertopic_id": 4,
    "title": "Market Fluctuations and Stock Performance",
    "summary": "OVERVIEW:\nRecent market reports highlight significant fluctuations in stock performance across various regions and sectors, with notable impacts from both earnings reports and broader market conditions.\n\nKEY EXAMPLES:\n- Wingstop's stock dropped 12% as its profit fell short of estimates.\n- In contrast, Plus500 reported an 11% increase in quarterly revenue, indicating strong performance.  \n- Colombian stocks showed resilience with a 0.29% increase in the COLCAP index.\n- Meanwhile, Canada’s S&P/TSX Composite index fell by 0.18%.",
    "article_count": 35,
    "topicality": 35.0,
    "theme_weight": 0.9714285714285716,
    "theme": "Inflation"
  },
  "T5": {
    "topic_id": "T5",
    "bertopic_id": 5,
    "title": "** Banking Industry Insights",
    "summary": "**OVERVIEW:**  \nRecent analyses highlight the evolving landscape of the U.S. banking sector, emphasizing the transition towards more diversified financial activities while assessing vulnerabilities and regulatory challenges.\n\n**KEY EXAMPLES:**\n- A new solvency metric, Economic Capital, reportedly identifies failing banks more effectively than traditional measures.\n- U.S. banks are increasingly integrating nonbank financial institution activities into their operations, reflecting a shift from traditional deposit and loan functions.\n- A study reveals that liquidity and rate risks are managed in various ways across 46 banks, pointing to differing strategies within the industry.",
    "article_count": 27,
    "topicality": 27.0,
    "theme_weight": 1.1407407407407406,
    "theme": "Bank lending and credit risk"
  },
  "T6": {
    "topic_id": "T6",
    "bertopic_id": 6,
    "title": "**U.S. Economic Trends**",
    "summary": "OVERVIEW:\nRecent reports highlight strong consumer spending and GDP growth, but also underline ongoing challenges such as inflation, productivity concerns, and differing perceptions of wealth among younger generations.\n\nKEY EXAMPLES:\n- U.S. GDP grew at a 4.3 percent annual rate, exceeding expectations due to robust consumer spending.\n- Despite positive GDP growth, U.S. productivity has slowed down while unit labor costs have increased.\n- Economists assert that typical middle-class families are wealthier than those in the 1960s, though many younger Americans disagree.",
    "article_count": 26,
    "topicality": 26.0,
    "theme_weight": 1.0115384615384615,
    "theme": "Inflation"
  },
  "T7": {
    "topic_id": "T7",
    "bertopic_id": 7,
    "title": "Cybersecurity Threats and Solutions",
    "summary": "OVERVIEW:\nRecent cybersecurity articles highlight the increasing sophistication of attacks targeting administrative accounts and the need for improved security measures across various sectors, including healthcare and technology.\n\nKEY EXAMPLES:\n- Attackers are exploiting weak authentication methods, such as RC4, to access admin accounts and extract sensitive data.\n- The healthcare sector is experiencing a rise in cyberattacks, with industry leaders asserting that current security proposals are inadequate.\n- ServiceNow's acquisition aimed at enhancing autonomous cybersecurity reflects the industry's shift towards proactive defense strategies against evolving threats.",
    "article_count": 24,
    "topicality": 24.0,
    "theme_weight": 0.9874999999999999,
    "theme": "Cyber attacks"
  },
  "T8": {
    "topic_id": "T8",
    "bertopic_id": 8,
    "title": "Crypto Security and Scams",
    "summary": "OVERVIEW: \nThe crypto industry faced significant challenges and developments in 2025, with a surge in cybercrime, particularly social engineering attacks, alongside advancements in security measures and regulatory frameworks. The emergence of decentralized identity and privacy solutions marked a shift in the industry's focus towards more secure practices.\n\nKEY EXAMPLES:\n- North Korean hackers stole $2.02 billion in cryptocurrency in 2025, a record high linked to ongoing state-sponsored cybercrime activities.\n- Over $2.17 billion was stolen from cryptocurrency services in the first half of 2025, prompting new security initiatives like Chainalysis's Hexagate.\n- Social engineering scams intensified, leveraging AI advancements to make detection increasingly difficult for victims.\n- Regulatory changes transformed the perception of crypto as a speculative investment to a legitimate capital markets infrastructure.",
    "article_count": 24,
    "topicality": 24.0,
    "theme_weight": 0.8708333333333332,
    "theme": "Digital assets"
  },
  "T9": {
    "topic_id": "T9",
    "bertopic_id": 9,
    "title": "Evolving Global Trade Dynamics",
    "summary": "OVERVIEW:\nRecent developments show significant shifts in global trade policies, particularly in U.S.-China relations and China's strategic foreign investment initiatives. These changes reflect broader trends in technology, industry sectors, and international policies that are reshaping the global economic landscape.\n\nKEY EXAMPLES:\n- China is revising its foreign investment catalogue to focus on advanced industries, increasing encouraged sectors to 1,679.\n- President Trump plans to impose an additional 10% tariff on imports from China in response to drug inflow issues.\n- The U.S. faces disparities in tariff rates among trade partners, with China subjected to rates as high as 40%, highlighting ongoing trade tensions.",
    "article_count": 24,
    "topicality": 24.0,
    "theme_weight": 1.0125,
    "theme": "Inflation"
  },
  "T10": {
    "topic_id": "T10",
    "bertopic_id": 10,
    "title": "US Retail and Market Movements",
    "summary": "OVERVIEW:\nRecent trends highlight significant shifts in the US retail landscape, with major closures and new market strategies in response to changing consumer behavior and company aspirations.\n\nKEY EXAMPLES:\n- Macy's, Kroger, and Carter's plan to close stores as part of a long-term strategy influenced by evolving consumer habits.\n- The launch of Shein's first physical store in Paris attracts customers despite protests, showcasing a growing interest in low-cost fast fashion.",
    "article_count": 22,
    "topicality": 22.0,
    "theme_weight": 1.0,
    "theme": "Others"
  },
  "T11": {
    "topic_id": "T11",
    "bertopic_id": 11,
    "title": "Impact of AI on Economy",
    "summary": "OVERVIEW: \nThe common theme across the articles is the significant influence of artificial intelligence (AI) on various sectors of the economy, including concerns from workers, implications for growth, and investment dynamics.\n\nKEY EXAMPLES:\n- Big Tech’s investment in AI is causing investor anxiety, yet technological advancements continue to promote market confidence.\n- Industry leaders discuss the potential impact of generative AI on jobs for nearly 2 million bank staff in the U.S.\n- Venture-capital firms are integrating AI into traditional sectors like accounting and property management, reflecting its expanding influence.",
    "article_count": 20,
    "topicality": 20.0,
    "theme_weight": 0.9949999999999999,
    "theme": "AI"
  },
  "T12": {
    "topic_id": "T12",
    "bertopic_id": 12,
    "title": "Recent Congressional Actions",
    "summary": "OVERVIEW: A series of articles detail recent actions taken by the House Committees on Oversight and Government Reform and Foreign Affairs, highlighting their reports from early December 2025.\n\nKEY EXAMPLES:\n- The House Committee on Oversight and Government Reform reported multiple initiatives on December 2, 2025.\n- The House Committee on Foreign Affairs followed with its own set of reports on December 3, 2025.",
    "article_count": 19,
    "topicality": 19.0,
    "theme_weight": 1.0210526315789472,
    "theme": "Cyber attacks"
  },
  "T13": {
    "topic_id": "T13",
    "bertopic_id": 13,
    "title": "Federal Reserve Initiatives",
    "summary": "OVERVIEW:\nThe Federal Reserve Board is active in approving applications from banks and adapting its policies to support innovation and regulatory compliance in the financial sector.\n\nKEY EXAMPLES:\n- The Fed approved the application by National Bank Holdings Corporation.\n- It issued a new policy statement facilitating responsible innovation for Board-supervised banks.\n- The Fed requested public input on a new payment account for eligible financial institutions. \n- The Fed terminated enforcement actions with The Goldman Sachs Group and announced pricing for payment services effective January 1, 2026.",
    "article_count": 19,
    "topicality": 19.0,
    "theme_weight": 1.1157894736842102,
    "theme": "Bank lending and credit risk"
  },
  "T14": {
    "topic_id": "T14",
    "bertopic_id": 14,
    "title": "Economic Projections and Outlook",
    "summary": "OVERVIEW:\nSeveral articles discuss recent economic projections by the Federal Reserve and various financial institutions, highlighting expectations for growth, inflation, and fiscal policies for the upcoming years.\n\nKEY EXAMPLES:\n- The Federal Reserve's Summary of Economic Projections from the December FOMC meeting indicates a stronger growth outlook for 2025 compared to previous projections.\n- Deutsche Bank describes the US macro outlook for 2025 as \"murky at best,\" reflecting uncertainty amid changing economic conditions.\n- The Federal Reserve Bank of New York’s DSGE model projects higher inflation in 2025 due to cost-push shocks from tariffs, alongside a decrease in the predicted short-run natural rate of interest.",
    "article_count": 15,
    "topicality": 15.0,
    "theme_weight": 1.04,
    "theme": "Inflation"
  }
}